simveb-backend-develop/wdsl/anip-person.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:ns="http://x-road.eu/xsd/connector/CITIZEN_BY_NPI_LITE/0.0.1">
   <soapenv:Header>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>BJ</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>ANATT</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>SIMVEB</iden:subsystemCode>
      </xro:client>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>BJ</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>ANIP</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>RNP</iden:subsystemCode>
         <iden:serviceCode>CITIZEN_BY_NPI_LITE</iden:serviceCode>
         <!--Optional:-->
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
      <xro:userId>?</xro:userId>
      <xro:id>?</xro:id>
      <xro:protocolVersion>4.0</xro:protocolVersion>
   </soapenv:Header>
   <soapenv:Body>
      <ns:CITIZEN_BY_NPI_LITE>
         <NPI>{npi}</NPI>
      </ns:CITIZEN_BY_NPI_LITE>
   </soapenv:Body>
</soapenv:Envelope>
